DataProcessors/ПомощникНастройкиИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПомощникНастройкиИСМП</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЗначенияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОчередьСообщенийИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОчередьСообщенийИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийИСМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеСообщенийИСМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияУправленияЗаказами</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтанцияУправленияЗаказамиИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитыИсходящегоСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПротоколОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПоследнегоБлокаКодов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагружатьПосле</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИСМППрисоединенныеФайлы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагружатьДо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИСМППрисоединенныеФайлы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаМодификацииУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроизводственныйОбъектИС</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыГИСМТ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДальнейшиеДействияПоВзаимодействиюИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДальнейшиеДействияПоВзаимодействиюИСМП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АннулируйтеВыводИзОборота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулируйтеОтгрузку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитеАгрегацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитеАгрегациюСИсправлениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитеИндивидуализациюКИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитеОбмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитеПеремаркировку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитеПолучениеКодовМаркировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитеПроверку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитеФормированиеАТК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаблокируйтеКодыМаркировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакройтеЗаказНаЭмиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеGTINНаОстатки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеВходящиеДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеИдентификаторСоединения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеКвитанцию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеКодыМаркировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеМестаОсуществленияДеятельности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеНоменклатуруПоДанным1СН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеРазрешениеНаОтгрузкуПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеЗавершенияОбработкиДанныхИСМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПередачуДанныхРегламентнымЗаданием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткажитесьОтНакладной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитеОперацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитеПередачуДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитеРазрешениеНаОтгрузкуПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитеПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередайтеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередайтеДанныеСИсправлениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередайтеОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередайтеОтчетСИсправлениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереформируйтеЭлектронныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитеОбработкуОтклонений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВведитеВОборот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВведитеВОборотСИсправлениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитеПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитеПоступлениеСИсправлениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласиеОПредоставлениеИнформации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздайтеШтрихкодыУпаковок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередайтеУведомлениеОбОтгрузкеНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитеУведомлениеОбОтгрузкеНаЭкспорт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыОбработкиОтчетаИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОбработкиОтчетаИСМП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненияОбработаны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗагрузкиНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТоварныеГруппыГИСМТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТоварныеГруппыГИСМТ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКлассификаторовВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаПоставляемыхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПомощникНастройкиИСМП/Forms/ПомощникНастройкиИСМП/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ОбновитьИнтерфейс;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	РежимРаботыСТестовымКонтуромИСМП = Константы.РежимРаботыСТестовымКонтуромИСМП.Получить();
	ОтсутствуетПодключениеИСМП = Истина;
	
	УпрощеннаяИнтеграцияБЭД = ИнтеграцияИС.УпрощеннаяИнтеграцияБЭД();
	
	ВидыПродукции = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииИСМП(Истина);
	ВидыПродукцииОСУ = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииОбъемноСортовогоУчета();
	ТоварныеГруппыОСУ = Новый ФиксированныйМассив(
		КонструкторИСОбщегоНазначенияКлиентСервер.ЗначенияЭлементаКонструктораПоВидуПродукции(
			ПредопределенноеЗначение(
				"Справочник.ЭлементыКонструктораВидовПродукцииИС.ТоварныеГруппыГИСМТ"),
			ВидыПродукцииОСУ));
	
	Для Каждого ВидПродукции Из ВидыПродукции Цикл
		Строка = МаркируемаяПродукция.Добавить();
		Строка.ВидПродукции = ВидПродукции;
		Строка.Включен1С = Истина;
		Строка.ВидПродукцииИспользуетОСУ = ВидыПродукцииОСУ.Найти(ВидПродукции) <> Неопределено;
		Строка.ТоварнаяГруппа = КонструкторИСМПОбщегоНазначенияКлиентСервер.ТоварнаяГруппаПоВидуПродукции(ВидПродукции);
	КонецЦикла;
	
	МаркируемаяПродукция.Сортировать("ВидПродукции");
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	Если УпрощеннаяИнтеграцияБЭД
		И ЗначениеЗаполнено(Организация)
		И МаркируемаяПродукция.Количество() > 0 Тогда
		ОбновитьСостояниеЗагрузкиОстатков();
	ИначеЕсли Не ЗначениеЗаполнено(Организация) Тогда
		НастроитьЭлементыФормы(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Организация) И МаркируемаяПродукция.Количество() Тогда
		ПодключитьОбработчикОжидания("ОбработкаОжиданияОбновитьОстаткиТоварныеГруппы", 0.5, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбновитьОстаткиТоварныеГруппыНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтсутствуетПодключениеИСМПОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ПроверитьЗаполнение() Тогда
		
		ОчиститьСообщения();
		
		Если НавигационнаяСсылкаФорматированнойСтроки = "ВыполнитьПодключениеИСМП" Тогда
			ОтсутствуетПодключениеИСМП = Ложь;
			ЗапроситьКлючСессииНачало();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		ОбновитьОстаткиТоварныеГруппыНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНоменклатуру(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		ПодготовитьСообщенияЗагрузкиОстатков();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	ОбменДаннымиИСМПКлиент.ВыполнитьОбмен(
		ЭтотОбъект,
		Организация);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	///////////////////////////////////////////////////////////////////
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МаркируемаяПродукцияРекомендуемыеДействия.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.МаркируемаяПродукцияРекомендуемыеДействия.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'не требуется'"));
	
	///////////////////////////////////////////////////////////////////
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МаркируемаяПродукцияРекомендуемыеДействия.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.МаркируемаяПродукцияРекомендуемыеДействия.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ДействиеПодписатьДоговор();
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'не подписан договор с оператором Честный Знак'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаТребуетВниманияГосИС);
	
	///////////////////////////////////////////////////////////////////
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МаркируемаяПродукцияРекомендуемыеДействия.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.МаркируемаяПродукцияРекомендуемыеДействия.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ДействиеЗагрузитьОстатки();
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'загрузите номенклатуру из Честного Знака'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаТребуетВниманияГосИС);
	
	///////////////////////////////////////////////////////////////////
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МаркируемаяПродукцияРекомендуемыеДействия.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.МаркируемаяПродукцияРекомендуемыеДействия.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ДействиеОжидатьОбработкиДокумента();
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'ожидается загрузка номенклатуры, выполните обмен'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьЭлементыФормы(Форма)
	
	Форма.Элементы.МаркируемаяПродукцияЗагрузитьНоменклатуру.Видимость = Форма.УпрощеннаяИнтеграцияБЭД;
	Форма.Элементы.МаркируемаяПродукцияВыполнитьОбмен.Видимость = Форма.УпрощеннаяИнтеграцияБЭД;
	
	Форма.Элементы.ГруппаОтсутствуетПодключениеИСМП.Видимость = Форма.ОтсутствуетПодключениеИСМП;
	Форма.Элементы.МаркируемаяПродукцияВыполнитьОбмен.Доступность = ЗначениеЗаполнено(Форма.Организация);

КонецПроцедуры

#Область Обмен

&НаКлиенте
Процедура ОбработкаОжиданияОбновитьОстаткиТоварныеГруппы()
	
	ОбновитьОстаткиТоварныеГруппыНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьОбменОбработкаОжидания() Экспорт
	
	ОбменДаннымиИСМПКлиент.ПродолжитьВыполнениеОбмена(ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриЗавершенииОперации(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьСостояниеЗагрузкиОстатков();
	
КонецПроцедуры

#КонецОбласти

#Область ТоварныеГруппы

&НаКлиенте
Процедура ОбновитьОстаткиТоварныеГруппыНаКлиенте(ВызовПослеАвторизации = Ложь) Экспорт
	
	ОчиститьСообщения();
	
	ОтсутствуетПодключениеИСМП = Ложь;
	Результат = ОбновитьОстаткиТоварныеГруппыНаСервере();

	Если Результат.ТребуетсяОбновлениеКлючаСессии = Истина Тогда
		Если ВызовПослеАвторизации Тогда
			ТекстОшибки = НСтр("ru = 'Не удалось выполнить авторизацию.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Иначе
			ЗапроситьКлючСессииНачало();
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ТекстОшибки);
	Иначе
		Оповестить("ИСМП_СинхронизированыТоварныеГруппы",, ЭтотОбъект);
	КонецЕсли;
	
	НастроитьЭлементыФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ОбновитьОстаткиТоварныеГруппыНаСервере()
	
	ОбновитьДанныеОстатков = МаркируемаяПродукция.Количество();
	
	Результат = ПолучитьТоварныеГруппыНаСервере();

	Если УпрощеннаяИнтеграцияБЭД
		И Не (Результат.ТребуетсяОбновлениеКлючаСессии = Истина 
		      Или ЗначениеЗаполнено(Результат.ТекстОшибки))
		И ОбновитьДанныеОстатков Тогда
		ОбновитьСостояниеЗагрузкиОстатков();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьТоварныеГруппыНаСервере()
	
	РеквизитыОрганизации = РаботаСКонтрагентамиИСВызовСервера.ИННКПППоОрганизацииКонтрагенту(Организация);
	РезультатЗапроса = ИнтерфейсИСМПОбщегоНазначения.ЗапроситьСтатусРегистрацииУчастникаИТоварныеГруппы(Организация, РеквизитыОрганизации.ИНН);
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", РезультатЗапроса.ТребуетсяОбновлениеКлючаСессии);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                    РезультатЗапроса.ТекстОшибки);
	
	Если РезультатЗапроса.ТребуетсяОбновлениеКлючаСессии Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатЗапроса.ТекстОшибки) Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ДанныеФормыСинхронизированыЧЗ = Истина;
	
	Для Каждого СтрокаТаблицы Из МаркируемаяПродукция Цикл
		СтрокаТаблицы.ВключенЧЗ = Ложь;
		УстановитьДействиеНеТребуется(СтрокаТаблицы, Истина);
	КонецЦикла;
	
	Если РезультатЗапроса.ТоварныеГруппы.Количество() > 0 Тогда
		
		ВидыПродукции = ВидыПродукции(РезультатЗапроса.ТоварныеГруппы);
		РезультатЗаписи = ЗаписатьМаркируемыеВидыПродукции(ВидыПродукции);
		
		ПараметрыОтбора = Новый Структура;
		Для Каждого Строка Из ВидыПродукции Цикл
			ПараметрыОтбора.Вставить("ВидПродукции", Строка.ВидПродукции);
			НайденныеСтроки = МаркируемаяПродукция.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				СтрокаТаблицы = МаркируемаяПродукция.Добавить();
				СтрокаТаблицы.ВидПродукции = Строка.ВидПродукции;
				СтрокаТаблицы.ТоварнаяГруппа = Строка.ТоварнаяГруппа;
				СтрокаТаблицы.Включен1С = РезультатЗаписи;
				СтрокаТаблицы.ВключенЧЗ = Истина;
			Иначе
				Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
					СтрокаТаблицы.Включен1С = СтрокаТаблицы.Включен1С Или РезультатЗаписи;
					СтрокаТаблицы.ВключенЧЗ = Истина;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		МаркируемаяПродукция.Сортировать("ВидПродукции");
		
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из МаркируемаяПродукция Цикл
		
		Если Не СтрокаТаблицы.ВключенЧЗ Тогда
			УстановитьДействиеПодписатьДоговорПоТГ(СтрокаТаблицы);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

&НаКлиенте
Процедура ЗапроситьКлючСессииНачало(ПовторныйЗапрос = Ложь)

	ОповещениеПриЗапросеКлючаСессии = Новый ОписаниеОповещения("ЗапроситьКлючСессииЗавершение", ЭтотОбъект);

	ПараметрыЗапроса = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация);

	ИнтерфейсАвторизацииИСМПКлиент.ЗапроситьКлючСессии(
		ПараметрыЗапроса, ОповещениеПриЗапросеКлючаСессии);

КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьКлючСессииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ОтказОтАвторизации = Ложь;
	ОшибкаАвторизации  = Ложь;
	
	ОтсутствуетПодключениеИСМП = Истина;
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		ОтказОтАвторизации = Истина;
	Иначе
		РезультатАвторизации = Результат[Организация];

		Если РезультатАвторизации = Неопределено Тогда
			ОшибкаАвторизации = Истина;
			ТекстОшибки = НСтр("ru = 'Произошла ошибка при авторизации.'");
		ИначеЕсли РезультатАвторизации <> Истина Тогда
			ОшибкаАвторизации = Истина;
			ТекстОшибки = РезультатАвторизации;
		КонецЕсли;
	КонецЕсли;

	Если ОтказОтАвторизации Тогда
		
		НастроитьЭлементыФормы(ЭтотОбъект);
		Возврат;
		
	ИначеЕсли ОшибкаАвторизации Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		
	Иначе
		
		ОтсутствуетПодключениеИСМП = Ложь;
		ОбновитьОстаткиТоварныеГруппыНаКлиенте(Истина);
		
	КонецЕсли;
	НастроитьЭлементыФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидыПродукции(ТоварныеГруппы)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТоварныеГруппы", ТоварныеГруппы);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияТоварныеГруппы.ТоварнаяГруппа КАК ТоварнаяГруппа,
	|	ЗначенияТоварныеГруппы.ВидПродукции КАК ВидПродукции,
	|	ЗначенияВидыПродукции.ВидПродукции ЕСТЬ NULL КАК ТребуетсяЗаписать
	|ИЗ
	|	Справочник.ТоварныеГруппыГИСМТ КАК ТоварныеГруппыГИСМТ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ ЗначенияЭлементовКонструктора.ВидПродукции КАК ВидПродукции,
	|			ЗначенияЭлементовКонструктора.Значение КАК ТоварнаяГруппа
	|		ИЗ РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктора
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
	|			ПО ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора
	|			И ЗначенияЭлементовКонструктора.ВидПродукции = ЗначенияПользователяЭлементовКонструктора.ВидПродукции
	|		ГДЕ ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.ТоварныеГруппыГИСМТ)
	|			И ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
	|		ОБЪЕДИНИТЬ
	|		ВЫБРАТЬ ЗначенияПользователяЭлементовКонструктора.ВидПродукции,
	|			ЗначенияПользователяЭлементовКонструктора.Значение
	|		ИЗ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
	|		ГДЕ ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.ТоварныеГруппыГИСМТ)
	|			И НЕ ЗначенияПользователяЭлементовКонструктора.ПометкаУдаления
	|		) КАК ЗначенияТоварныеГруппы
	|	ПО ТоварныеГруппыГИСМТ.Ссылка = ЗначенияТоварныеГруппы.ТоварнаяГруппа
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ ЗначенияЭлементовКонструктора.ВидПродукции КАК ВидПродукции
	|		ИЗ РегистрСведений.ЗначенияЭлементовКонструктораВидовПродукцииИС КАК ЗначенияЭлементовКонструктора
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
	|		ПО ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора
	|		И ЗначенияЭлементовКонструктора.ВидПродукции = ЗначенияПользователяЭлементовКонструктора.ВидПродукции
	|		ГДЕ ЗначенияЭлементовКонструктора.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.ВидыПродукцииГИСМТ)
	|			И ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора ЕСТЬ NULL
	|		ОБЪЕДИНИТЬ
	|		ВЫБРАТЬ ЗначенияПользователяЭлементовКонструктора.ВидПродукции
	|		ИЗ РегистрСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС КАК ЗначенияПользователяЭлементовКонструктора
	|		ГДЕ ЗначенияПользователяЭлементовКонструктора.ЭлементКонструктора = ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.ВидыПродукцииГИСМТ)
	|			И НЕ ЗначенияПользователяЭлементовКонструктора.ПометкаУдаления
	|		) КАК ЗначенияВидыПродукции
	|	ПО ЗначенияТоварныеГруппы.ВидПродукции = ЗначенияВидыПродукции.ВидПродукции
	|ГДЕ
	|	ТоварныеГруппыГИСМТ.Имя В (&ТоварныеГруппы)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаписатьМаркируемыеВидыПродукции(ВидыПродукции)
	
	Результат = Истина;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТребуетсяЗаписать", Истина);
	НайденныеСтроки = ВидыПродукции.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		Для Каждого Строка Из НайденныеСтроки Цикл
			Набор = РегистрыСведений.ЗначенияПользователяЭлементовКонструктораВидовПродукцииИС.СоздатьНаборЗаписей();
			Набор.Отбор.ЭлементКонструктора.Установить(Справочники.ЭлементыКонструктораВидовПродукцииИС.ВидыПродукцииГИСМТ);
			Набор.Отбор.ВидПродукции.Установить(Строка.ВидПродукции);
			Запись = Набор.Добавить();
			Запись.ЭлементКонструктора = Справочники.ЭлементыКонструктораВидовПродукцииИС.ВидыПродукцииГИСМТ;
			Запись.ВидПродукции = Строка.ВидПродукции;
			Набор.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
			НСтр("ru = 'Не удалось включить использование товарных групп по причине %1'"),
			ОбработкаОшибок.СообщениеОбОшибкеДляПользователя(ИнформацияОбОшибке())));
		Результат = Ложь;
		
	КонецПопытки;
	
	Если Результат Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СоздатьДокументыОтчетИСМП

&НаКлиенте
Процедура ПодготовитьСообщенияЗагрузкиОстатков()
	
	ПараметрыОбработкиДокументов = ОбменДаннымиИСМПКлиентСервер.ПараметрыОбработкиДокументов();
	ПараметрыОбработкиДокументов.Ссылка             = ПредопределенноеЗначение("Документ.ОтчетИСМП.ПустаяСсылка");
	ПараметрыОбработкиДокументов.Организация        = Организация;
	ПараметрыОбработкиДокументов.ДальнейшееДействие = ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияПоВзаимодействиюИСМП.ЗапроситеОтчет");
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗагрузкаОстатков",  Истина);
	ДополнительныеПараметры.Вставить("ТоварныеГруппы",    Новый Массив);
	ДополнительныеПараметры.Вставить("ТоварныеГруппыОСУ", Новый Массив);
	
	Для Каждого СтрокаТаблицы Из МаркируемаяПродукция Цикл
		Если СтрокаТаблицы.РекомендуемыеДействия = ДействиеЗагрузитьОстатки() Тогда
			Если ДополнительныеПараметры.ТоварныеГруппы.Найти(СтрокаТаблицы.ТоварнаяГруппа) = Неопределено Тогда
				ДополнительныеПараметры.ТоварныеГруппы.Добавить(СтрокаТаблицы.ТоварнаяГруппа);
			КонецЕсли;
			Если СтрокаТаблицы.ВидПродукцииИспользуетОСУ
				И ДополнительныеПараметры.ТоварныеГруппыОСУ.Найти(СтрокаТаблицы.ТоварнаяГруппа) = Неопределено Тогда
				ДополнительныеПараметры.ТоварныеГруппыОСУ.Добавить(СтрокаТаблицы.ТоварнаяГруппа);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ДополнительныеПараметры.ТоварныеГруппы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОбработкиДокументов.ДополнительныеПараметры = ДополнительныеПараметры;
	
	ОписаниеПриЗавершении = Новый ОписаниеОповещения(
		"Подключаемый_ПриЗавершенииОперации", ЭтотОбъект, ПараметрыОбработкиДокументов);
	
	ОбменДаннымиИСМПКлиент.ПодготовитьКПередаче(
		ЭтотОбъект,
		ПараметрыОбработкиДокументов,
		ОписаниеПриЗавершении);
		
КонецПроцедуры

#КонецОбласти

#Область НастройкаФормы

&НаСервере
Процедура ОбновитьСостояниеЗагрузкиОстатков();
	
	Если Не УпрощеннаяИнтеграцияБЭД Тогда
		Возврат;
	КонецЕсли;
	
	// Проверить загруженные остатки
	
	СписокЗапросов = Новый СписокЗначений;
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ТоварныеГруппыГИСМТ.Ссылка КАК ТоварнаяГруппа,
	|	ЕСТЬNULL(СтатусыДокументовИСМП.Статус, НЕОПРЕДЕЛЕНО) КАК Статус,
	|	ВЫБОР
	|		КОГДА ОчередьСообщений.Сообщение ЕСТЬ NULL
	|			ТОГДА ЕСТЬNULL(СтатусыДокументовИСМП.ДальнейшееДействие1, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюИСМП.ОжидайтеЗавершенияОбработкиДанныхИСМП)
	|	КОНЕЦ КАК ДальнейшееДействие
	|ИЗ
	|	Справочник.ТоварныеГруппыГИСМТ КАК ТоварныеГруппыГИСМТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетИСМП КАК ОтчетИСМП
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовИСМП КАК СтатусыДокументовИСМП
	|			ПО ОтчетИСМП.Ссылка = СтатусыДокументовИСМП.Документ
	|		ПО ТоварныеГруппыГИСМТ.Ссылка = ОтчетИСМП.ТоварнаяГруппа
	|		И ОтчетИСМП.Операция = &СписокКИНаБалансе
	|		И ОтчетИСМП.Организация = &Организация
	|		И ОтчетИСМП.Проведен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьСообщенийИСМП КАК ОчередьСообщений
	|		ПО ТоварныеГруппыГИСМТ.Ссылка = ОчередьСообщений.ТоварнаяГруппа
	|		И ОчередьСообщений.Операция = &СписокКИНаБалансе
	|		И ОчередьСообщений.Организация = &Организация
	|ГДЕ
	|	ТоварныеГруппыГИСМТ.Ссылка В (&ТоварныеГруппы)",
	"ОтчетИСМПСписокКИНаБалансе");
	
	СписокЗапросов.Добавить(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТоварныеГруппыГИСМТ.Ссылка КАК ТоварнаяГруппа,
	|	ЕСТЬNULL(СтатусыДокументовИСМП.Статус, НЕОПРЕДЕЛЕНО) КАК Статус,
	|	ЕСТЬNULL(СтатусыДокументовИСМП.ДальнейшееДействие1, НЕОПРЕДЕЛЕНО) КАК ДальнейшееДействие
	|ИЗ
	|	Справочник.ТоварныеГруппыГИСМТ КАК ТоварныеГруппыГИСМТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетИСМП КАК ОтчетИСМП
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовИСМП КАК СтатусыДокументовИСМП
	|			ПО ОтчетИСМП.Ссылка = СтатусыДокументовИСМП.Документ
	|		ПО ТоварныеГруппыГИСМТ.Ссылка = ОтчетИСМП.ТоварнаяГруппа
	|		И ОтчетИСМП.Операция = &ОстаткиВиртуальногоСклада
	|		И ОтчетИСМП.Организация = &Организация
	|		И ОтчетИСМП.Проведен
	|ГДЕ
	|	ТоварныеГруппыГИСМТ.Ссылка В (&ТоварныеГруппыОСУ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТоварныеГруппыГИСМТ.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияПоВзаимодействиюИСМП.ОжидайтеЗавершенияОбработкиДанныхИСМП)
	|ИЗ
	|	Справочник.ТоварныеГруппыГИСМТ КАК ТоварныеГруппыГИСМТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьСообщенийИСМП КАК ОчередьСообщений
	|		ПО ТоварныеГруппыГИСМТ.Ссылка = ОчередьСообщений.ТоварнаяГруппа
	|		И ОчередьСообщений.Операция = &ОстаткиВиртуальногоСклада
	|		И ОчередьСообщений.Организация = &Организация
	|ГДЕ
	|	ТоварныеГруппыГИСМТ.Ссылка В (&ТоварныеГруппыОСУ)",
	"ОтчетИСМПОстаткиВиртуальногоСклада");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",               Организация);
	Запрос.УстановитьПараметр("ТоварныеГруппы",            МаркируемаяПродукция.Выгрузить(, "ТоварнаяГруппа").ВыгрузитьКолонку("ТоварнаяГруппа"));
	Запрос.УстановитьПараметр("СписокКИНаБалансе",         Перечисления.ВидыОперацийИСМП.ОтчетИСМПСписокКИНаБалансе);
	Запрос.УстановитьПараметр("ОстаткиВиртуальногоСклада", Перечисления.ВидыОперацийИСМП.ОтчетИСМПОстаткиВиртуальногоСклада);
	Запрос.УстановитьПараметр("ТоварныеГруппыОСУ",         ТоварныеГруппыОСУ);
	
	РезультатЗапроса = ОбщегоНазначенияИС.ВыполнитьПакетЗапросов(Запрос, СписокЗапросов);
	
	КонечныйСтатус = Перечисления.СтатусыОбработкиОтчетаИСМП.ПолученОтчет;
	ДействияТребующиеОжидания = Документы.ОтчетИСМП.ВсеТребующиеОжидания();
	
	ЕстьСообщенияОСУВОчереди = Ложь;
	
	//@skip-warning
	ОстаткиВиртуальногоСклада = РезультатЗапроса["ОтчетИСМПОстаткиВиртуальногоСклада"].Выбрать();
	Пока ОстаткиВиртуальногоСклада.Следующий() Цикл
		Если ОстаткиВиртуальногоСклада.Статус = КонечныйСтатус Тогда
			ОстаткиОСУЗагружены = Истина;
			Прервать;
		ИначеЕсли ДействияТребующиеОжидания.Найти(ОстаткиВиртуальногоСклада.ДальнейшееДействие) <> Неопределено Тогда
			ЕстьСообщенияОСУВОчереди = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	//@skip-warning
	СписокКИНаБалансе = РезультатЗапроса["ОтчетИСМПСписокКИНаБалансе"].Выгрузить();
	
	ПараметрыОтбора = Новый Структура;
	Для Каждого СтрокаТаблицы Из МаркируемаяПродукция Цикл
		
		УстановитьДействиеНеТребуется(СтрокаТаблицы, Не ДанныеФормыСинхронизированыЧЗ);
		
		СтрокаТаблицы.ЗапрошеныОстаткиОСУ = Ложь;
		Если СтрокаТаблицы.ВидПродукцииИспользуетОСУ Тогда
			Если ОстаткиОСУЗагружены Тогда
				СтрокаТаблицы.ЗапрошеныОстаткиОСУ = Истина;
			ИначеЕсли ЕстьСообщенияОСУВОчереди Тогда
				УстановитьДействиеДокументОбрабатывается(СтрокаТаблицы);
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыОтбора.Вставить("ТоварнаяГруппа", СтрокаТаблицы.ТоварнаяГруппа);
		НайденныеСтроки = СписокКИНаБалансе.НайтиСтроки(ПараметрыОтбора);
		
		СтрокаТаблицы.ЗапрошеныОстатки = Ложь;
		Для Каждого СтрокаОстатков Из НайденныеСтроки Цикл
			Если СтрокаОстатков.Статус = КонечныйСтатус Тогда
				СтрокаТаблицы.ЗапрошеныОстатки = Истина;
				Прервать;
			ИначеЕсли ДействияТребующиеОжидания.Найти(СтрокаОстатков.ДальнейшееДействие) <> Неопределено Тогда
				УстановитьДействиеДокументОбрабатывается(СтрокаТаблицы);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если КонструкторИСМПКлиентСервер.ВидПродукцииПоддерживаетЗагрузкуСпискаКИНаБалансе(СтрокаТаблицы.ТоварнаяГруппа)
			И (Не СтрокаТаблицы.ЗапрошеныОстатки
			   Или (СтрокаТаблицы.ВидПродукцииИспользуетОСУ
			        И Не ЕстьСообщенияОСУВОчереди
			        И Не СтрокаТаблицы.ЗапрошеныОстаткиОСУ)) Тогда
			УстановитьДействиеЗагрузитьОстатки(СтрокаТаблицы);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДействиеНеТребуется(СтрокаТаблицы, Принудительно = Ложь)
	Если Принудительно Или СтрокаТаблицы.РекомендуемыеДействия <> ДействиеПодписатьДоговор() Тогда
		СтрокаТаблицы.РекомендуемыеДействия = ДействиеНеТребуется();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьДействиеПодписатьДоговорПоТГ(СтрокаТаблицы)
	СтрокаТаблицы.РекомендуемыеДействия = ДействиеПодписатьДоговор();
КонецПроцедуры

&НаСервере
Процедура УстановитьДействиеЗагрузитьОстатки(СтрокаТаблицы)
	Если СтрокаТаблицы.РекомендуемыеДействия <> ДействиеПодписатьДоговор() Тогда
		СтрокаТаблицы.РекомендуемыеДействия = ДействиеЗагрузитьОстатки();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьДействиеДокументОбрабатывается(СтрокаТаблицы)
	СтрокаТаблицы.РекомендуемыеДействия = ДействиеОжидатьОбработкиДокумента();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДействиеОжидатьОбработкиДокумента()
	Возврат 3;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДействиеЗагрузитьОстатки()
	Возврат 2;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДействиеПодписатьДоговор()
	Возврат 1;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДействиеНеТребуется()
	Возврат 0;
КонецФункции

#КонецОбласти

#КонецОбласти
